tap "coursier/formulas", trusted: true
# Download with resuming and segmented downloading
brew "aria2"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Yet another cross-platform graphical process/system monitor
brew "bottom"
# Resource monitor. C++ version and continuation of bashtop and bpytop
brew "btop"
# Console Matrix
brew "cmatrix"
# Generates code snapshots in various formats
brew "codesnap"
# Create and run Linux containers using lightweight virtual machines
brew "container", link: false
# GNU File, Shell, and Text utilities
brew "coreutils"
# More intuitive version of du in rust
brew "dust"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# Validating, recursive, caching DNS resolver
brew "unbound"
# GNU Emacs text editor
brew "emacs"
# Modern, maintained replacement for ls
brew "eza"
# Like neofetch, but much faster because written mostly in C
brew "fastfetch"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Play, record, convert, and stream select audio and video codecs
brew "ffmpeg"
# Fast and simple Node.js version manager
brew "fnm"
# Command-line fuzzy finder written in Go
brew "fzf"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Modern download manager that supports all platform
brew "gopeed"
# General-purpose data compression with high compression ratio
brew "xz"
# Open-source build automation tool based on the Groovy and Kotlin DSL
brew "gradle"
# Like cURL, but for gRPC
brew "grpcurl"
# Improved top (interactive process viewer)
brew "htop"
# Command-line benchmarking tool
brew "hyperfine"
# Tools and libraries to manipulate images in select formats
brew "imagemagick"
# Java language specific implementation of the Language Server Protocol
brew "jdtls"
# Domain specific configuration language for defining JSON data
brew "jsonnet"
# Tool that can switch between kubectl contexts easily and create aliases
brew "kubectx"
# Kubernetes command-line interface
brew "kubernetes-cli"
# Template-free customization of Kubernetes YAML manifests
brew "kustomize"
# Simple terminal UI for git commands
brew "lazygit"
# Sophisticated file transfer program
brew "lftp"
# Linux virtual machines
brew "lima"
# Clone of ls with colorful output, file type icons, and more
brew "lsd"
# Package manager for the Lua programming language
brew "luarocks"
# Utility for directing compilation
brew "make"
# Mac App Store command-line interface
brew "mas"
# Java-based project management
brew "maven"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Find/fix obsolete Nerd Font icons
brew "nerdfix"
# PDF rendering library (based on the xpdf-3.0 code base)
brew "poppler"
# Modern replacement for ps written in Rust
brew "procs"
# Protocol buffers (Google's data interchange format)
brew "protobuf"
# Interpreted, interactive, object-oriented programming language
brew "python@3.12"
# Generic machine emulator and virtualizer
brew "qemu"
# SVG rendering tool and library
brew "resvg"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# CLI proxy to minimize LLM token consumption
brew "rtk"
# Powerful, clean, object-oriented scripting language
brew "ruby"
# Cross-platform network monitoring terminal UI with deep packet inspection
brew "rustnet"
# 7-Zip is a file archiver with a high compression ratio
brew "sevenzip"
# Tail multiple Kubernetes pods & their containers
brew "stern"
# Terminal multiplexer
brew "tmux"
# Program that allows you to count code, quickly
brew "tokei"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Internet file retriever
brew "wget"
# Blazing fast terminal file manager written in Rust, based on async I/O
brew "yazi"
# Pluggable terminal workspace, with terminal multiplexer as the base feature
brew "zellij"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# Launcher for Coursier
brew "coursier/formulas/coursier"
# Application uninstaller
cask "appcleaner"
# Tool to customise input devices and automate computer systems
cask "bettertouchtool"
# OpenAI's Codex desktop app for managing coding agents
cask "codex-app"
cask "container"
# App to build and share containerised applications and microservices
cask "docker-desktop"
cask "font-0xproto-nerd-font"
cask "font-3270-nerd-font"
cask "font-agave-nerd-font"
cask "font-anonymice-nerd-font"
cask "font-arimo-nerd-font"
cask "font-aurulent-sans-mono-nerd-font"
cask "font-bigblue-terminal-nerd-font"
cask "font-bitstream-vera-sans-mono-nerd-font"
cask "font-blex-mono-nerd-font"
cask "font-caskaydia-cove-nerd-font"
cask "font-caskaydia-mono-nerd-font"
cask "font-code-new-roman-nerd-font"
cask "font-comic-shanns-mono-nerd-font"
cask "font-commit-mono-nerd-font"
cask "font-cousine-nerd-font"
cask "font-d2coding-nerd-font"
cask "font-daddy-time-mono-nerd-font"
cask "font-dejavu-sans-mono-nerd-font"
cask "font-droid-sans-mono-nerd-font"
cask "font-envy-code-r-nerd-font"
cask "font-fantasque-sans-mono-nerd-font"
cask "font-fira-code-nerd-font"
cask "font-fira-mono-nerd-font"
cask "font-geist-mono-nerd-font"
cask "font-go-mono-nerd-font"
cask "font-gohufont-nerd-font"
cask "font-hack-nerd-font"
cask "font-hasklug-nerd-font"
cask "font-heavy-data-nerd-font"
cask "font-hurmit-nerd-font"
cask "font-im-writing-nerd-font"
cask "font-inconsolata-go-nerd-font"
cask "font-inconsolata-lgc-nerd-font"
cask "font-inconsolata-nerd-font"
cask "font-intone-mono-nerd-font"
cask "font-iosevka-nerd-font"
cask "font-iosevka-term-nerd-font"
cask "font-iosevka-term-slab-nerd-font"
cask "font-jetbrains-mono"
cask "font-jetbrains-mono-nerd-font"
cask "font-lekton-nerd-font"
cask "font-liberation-nerd-font"
cask "font-lilex-nerd-font"
cask "font-m+-nerd-font"
cask "font-martian-mono-nerd-font"
cask "font-meslo-lg-nerd-font"
cask "font-monaspice-nerd-font"
cask "font-monocraft-nerd-font"
cask "font-monofur-nerd-font"
cask "font-monoid-nerd-font"
cask "font-mononoki-nerd-font"
cask "font-noto-nerd-font"
cask "font-opendyslexic-nerd-font"
cask "font-overpass-nerd-font"
cask "font-profont-nerd-font"
cask "font-proggy-clean-tt-nerd-font"
cask "font-recursive-mono-nerd-font"
cask "font-roboto-mono-nerd-font"
cask "font-sauce-code-pro-nerd-font"
cask "font-shure-tech-mono-nerd-font"
cask "font-space-mono-nerd-font"
cask "font-symbols-only-nerd-font"
cask "font-terminess-ttf-nerd-font"
cask "font-tinos-nerd-font"
cask "font-ubuntu-mono-nerd-font"
cask "font-ubuntu-nerd-font"
cask "font-ubuntu-sans-nerd-font"
cask "font-victor-mono-nerd-font"
cask "font-zed-mono-nerd-font"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Utility to hide menu bar items
cask "hiddenbar"
# Free and open-source media player
cask "iina"
# HTTP and GraphQL Client
cask "insomnia"
# Open-source screen recorder built with web technology
cask "kap"
# File archiver
cask "keka"
# Tool to manage the launchpad
cask "launchpad-manager"
# Window manager
cask "loop"
# Mouse utility to add gesture functions and smooth scrolling to 3rd party mice
cask "mac-mouse-fix"
# Utility to open, create and modify archive files
cask "maczip"
# Htop on steroids
cask "neohtop"
# Full-screen slideshow program
cask "phoenix-slides"
# Window snapping tool
cask "rectangle-pro"
# Control windows and applications right from your trackpad
cask "swish"
# File transfer application
cask "transmit"
# GPU-accelerated cross-platform terminal emulator and multiplexer
cask "wezterm"
# Gecko based web browser
cask "zen"
# OpenJDK distribution from Azul
cask "zulu@11"
# OpenJDK distribution from Azul
cask "zulu@17"
# OpenJDK distribution from Azul
cask "zulu@21"
# OpenJDK distribution from Azul
cask "zulu@25"
# OpenJDK distribution from Azul
cask "zulu@8"
mas "AdGuard for Safari", id: 1440147259
mas "Evernote", id: 406056744
mas "Goodnotes", id: 1444383602
mas "HP Smart", id: 1474276998
mas "iMovie", id: 408981434
mas "Infuse", id: 1136220934
mas "Keynote", id: 409183694
mas "Microsoft Excel", id: 462058435
mas "Microsoft OneNote", id: 784801555
mas "Microsoft Outlook", id: 985367838
mas "Microsoft PowerPoint", id: 462062816
mas "Microsoft Word", id: 462054704
mas "Notability", id: 360593530
mas "Numbers", id: 409203825
mas "OneDrive", id: 823766827
mas "Pages", id: 409201541
mas "Pixea", id: 1507782672
mas "Spark", id: 1176895641
mas "Spark Desktop", id: 6445813049
mas "Speedtest", id: 1153157709
mas "Telegram", id: 747648890
mas "VidHub", id: 1659622164
mas "WeChat", id: 836500024
mas "WhatsApp", id: 310633997
mas "Windows App", id: 1295203466
mas "Xcode", id: 497799835
vscode "1yib.rust-bundle"
vscode "adpyke.vscode-sql-formatter"
vscode "aeschli.vscode-css-formatter"
vscode "alanwalk.markdown-toc"
vscode "angular.ng-template"
vscode "bierner.markdown-emoji"
vscode "charliermarsh.ruff"
vscode "csharpier.csharpier-vscode"
vscode "dart-code.dart-code"
vscode "dart-code.flutter"
vscode "davidanson.vscode-markdownlint"
vscode "docker.docker"
vscode "dotdevru.prettier-java"
vscode "dotjoshjohnson.xml"
vscode "dunstontc.viml"
vscode "dustypomerleau.rust-syntax"
vscode "eamodio.gitlens"
vscode "editorconfig.editorconfig"
vscode "emeraldwalk.runonsave"
vscode "esbenp.prettier-vscode"
vscode "fill-labs.dependi"
vscode "fireside21.cshtml-tm"
vscode "firsttris.vscode-jest-runner"
vscode "formulahendry.code-runner"
vscode "fwcd.kotlin"
vscode "golang.go"
vscode "google.geminicodeassist"
vscode "grapecity.gc-excelviewer"
vscode "jetbrains.resharper-code"
vscode "jnbt.vscode-rufo"
vscode "johnpapa.angular2"
vscode "kevinrose.vsc-python-indent"
vscode "kokororin.vscode-phpfmt"
vscode "malmaud.tmux"
vscode "mangeshrex.everblush"
vscode "mathiasfrohlich.kotlin"
vscode "mathiasfrohlich.latexcompile"
vscode "mechatroner.rainbow-csv"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-ceintl.vscode-language-pack-zh-hans"
vscode "ms-ceintl.vscode-language-pack-zh-hant"
vscode "ms-dotnettools.csdevkit"
vscode "ms-dotnettools.csharp"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.anycode-kotlin"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.powershell"
vscode "ms-vsliveshare.vsliveshare"
vscode "orta.vscode-jest"
vscode "pkief.material-icon-theme"
vscode "plibither8.remove-comments"
vscode "rangav.vscode-thunder-client"
vscode "redhat.java"
vscode "redhat.vscode-commons"
vscode "redhat.vscode-community-server-connector"
vscode "redhat.vscode-rsp-ui"
vscode "redhat.vscode-xml"
vscode "redhat.vscode-yaml"
vscode "redjue.git-commit-plugin"
vscode "rust-lang.rust-analyzer"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "shopify.ruby-lsp"
vscode "sonarsource.sonarlint-vscode"
vscode "tamasfe.even-better-toml"
vscode "vadimcn.vscode-lldb"
vscode "vmware.vscode-boot-dev-pack"
vscode "vmware.vscode-spring-boot"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
vscode "vscodevim.vim"
vscode "yinfei.luahelper"
vscode "yzane.markdown-pdf"
vscode "yzhang.markdown-all-in-one"
cargo "cargo-edit"
uv "black"
uv "pre-commit"
uv "ruff"
uv "ty"
npm "corepack"
